#### ElementParameterFilter Members

---

|  |
| --- |
| ElementParameterFilter Class   Constructors   Methods   Properties   See Also |

The  ElementParameterFilter  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ElementParameterFilter(FilterRule) | Constructs a new instance of an ElementParameterFilter from a single rule. |
| Public method | ElementParameterFilter(IList FilterRule ) | Constructs a new instance of an ElementParameterFilter from a set of rules. |
| Public method | ElementParameterFilter(FilterRule, Boolean) | Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule. |
| Public method | ElementParameterFilter(IList FilterRule , Boolean) | Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing the given filter rules. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ElementFilter  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetRules | Returns the set of rules contained in this filter. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | PassesFilter(Element) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from  ElementFilter  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from  ElementFilter  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ElementFilter  .) |

# See Also

ElementParameterFilter Class

Autodesk.Revit.DB Namespace